#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>


//define 定义 常数 和 宏   这里的报错无法解决
//#define BD 105
//#define MAX(a,b) (a>b?a:b)

//int mian()
//{
//	int a = 2;
//	int b = 3;
//	int c = a + b;
//	printf("%d\n", c);
//	return 0;
//
//}


//static 修饰函数时 因而可以知道 函数同样具有外部链接属性

//extern int Add(int , int );
//int main()
//{
//	int a = 10;
//	int b = 20;
//	int c;
//	c=Add(a, b);
//	printf("%d\n", c);
//}

//static 修饰局部变量可以改变其生命周期（只要进入该代码块它都在）但其作用域未变

// 
//void test()
//{
//	static int a = 1;
//	//这里注意局部变量的生命周期 变量a 每次调用完就销毁了
//	a++;
//	printf("%d ", a);
//}
//int main()
//{
//	int i = 0;
//	while (i < 10)
//	{
//		test();
//		i++;
//	}
//	return 0;
//}

//static 修饰全局变量 会使得其外部链接属性变成内部链接属性 使其不能在其他源文件之中连接使用，及不再具有跨源文件的特性

//extern int g_val;
//extern int g_val;
//int main()
//{
//	printf("%d\n", g_val);
//	return 0;
//}


//寄存器 register 是集成到CPU上的独立的存储空间  并不同于内存
// 网盘 硬盘 内存 高速缓存（cache） 寄存器 <------->  CPU

//register起建议将值放寄存器里面的作用 最终是由编译器决定放与不放的
//并且&-取地址 只针对内存进行 对寄存器并不适用




//各类关键字     定义变量名字的时候不能和关键字重复
//auto 一般都是省略掉的
//break 中断switch语句的
// continue 继续用于循环


//typedef unsigned int uint;
//int main()
//{
//	uint a = 10;
//
//}



//引用操作符
// 下标引用操作符 [ ]
//函数调用操作符 ()

//int main()
//{
//	int arr[10] = { 1,2,3,4,5,6,7,8,9,10 };
//	// 下标引用操作符 [ ]
//	printf("%d\n", arr[5]);
//    //函数调用操作符 ()
//	printf("呵呵!");
//}
//


//逗号表达式
//算的结果是最后一个表达式的结果

//int main()
//{
//	int a = 2;
//	int b = 4;
//	int c = 5;
//	int d = (a = b + 1, b = a + c,c=a+b, c -= 2);
//	printf("%d\n", d);
//}


//三目操作符

//int main()
//{
//	int a = 10;
//	int b = 0;
//	//if (a == 5)
//	//{
//	//	b = -6;
//
//	//}
//	//else
//	//{
//	//	b = 6;
//
//	//}
//
//	b = (a == 5 ? -6 : 6);// 三目操作符
//	printf("%d\n", b);
//	return 0;
//}



// 逻辑操作符
// 逻辑与 &&  并且
// 逻辑或 ||  或者

//int main()
//{
//	int a = 3;
//	int b = 4;
//	if ((a == 8) && (b == 4))
//		printf("&&\n");
//}
//int main()  //一个小问题 有待解决！  if语句后面 是没有 ； 的真服了
//{
//	int a, b;
//	scanf("%d%d", &a, &b);
//
//	
//	if ((a == 5) || (b == 10)) // 这里没有 ； 而且并不会报错
//	{
//		printf("逻辑或-||\n");
//	}
//
//}

// 关系操作符 >  <  >=  <=  !=  ==  =


// 单目操作符

// ++ /  -- 前置后置

//int main()
//{
//	//前置  先++/--后使用
//	//后置  先使用后++/--
//	int a = 2;
//	int b = ++a;
//	printf("b = %d\n", b);
//	printf("a = %d\n", a);
//
//	int c = 5;
//	int d = c--;
//	printf("d = %d\n", d);
//	printf("c = %d\n", c);
//
//	return 0;
//}


// ~  按位取反操作符

//int main()
//{
//	
//
//	//整数在内存中以二进制补码的形式存放 一个整数可以表示为 原码反码补码三种形式
//	// 计算的时候采用的也是补码
//	//正整数 原码反码补码相同
//	//负整数 原码反码补码需要进行计算
//	// 二进制的 最高位 0表示正数 1表示负数
//
//	//int a=-1;
//	//10000000 00000000 00000000 00000001 原码
//	//11111111 11111111 11111111 11111110 原码符号位不变 其他位按位取反得到反码
//	//11111111 11111111 11111111 11111111 反码二进制序列加1
//
//	int a = 0;
//	//00000000 00000000 00000000 00000000
//	printf("%d\n", ~a);//1
//	//11111111 11111111 11111111 11111111 补码
//
//	return 0;
//}


//sizeof()操作符 求取的是所占的内存空间 byte

//int main()
//{
//	int a = 10;
//	printf("%d\n", sizeof(a));
//}


//c语言里面 非0就是真  只有0才是假

//int main()
//{
	//if (!a)//进入 if语句
	//int a = 0;
	//printf("%d\n", !a);//默认 假变成真的时候 用1来进行表示
	//int b = 10;
	//printf("%d\n", !b);
	//return 0;
//}


//赋值操作符       这里的知识比较重要

// int a=10;创建一个变量a 并且初始化为10
//  a>>=1 表示 a右移一个位置之后再将值赋给 a  同理 a -=8 之类的


// 位（二进制）操作符

// 按位与   - &  只要对应二进制数有一个为 0 就是0
// 按位异或 - ^  相同为0 相异为 1
// 按位或   - |  只要有 1 就是 1
//int main()
//{	
//
//	//按位或
//	int a = 2;
//	//00000000 00000000 00000000 00000010
//	int b = 6;
//	//00000000 00000000 00000000 00000110
//	int c = a | b;
//	//00000000 00000000 00000000 00000110
//	printf("%d\n", c);//6
//
//
//	//按位异或
//	int a=5;
//	//00000000 00000000 00000000 00000101
//	int b = 4;
//	//00000000 00000000 00000000 00000100
//	int c = a ^ b;
//	//00000000 00000000 00000000 00000001
//	printf("%d\n", c);//1
//
//
//
//	//按位与
//	int a = 3;
//	//00000000 00000000 00000000 00000011
//	int b = 5;
//	//00000000 00000000 00000000 00000101
//	int c = a & b;
//	//00000000 00000000 00000000 00000001
//	printf("%d\n", c);
//
//	
//	return 0;
//}

//求100内奇数相加和

//int main()
//{
//	
//	int i=0;
//	int sum = 0;
//
//	while (i <= 100)
//	{
//		if (i % 2 == 1)//奇数则开始相加
//		{
//			sum = sum + i;
//			i++;
//		}
//		i++;
//	}
//	printf("奇数和为:%d\n", sum);
//}